def translate():
	symbol_dict = {'а':'a','б':'b','в':'v','г':'g','д':'d','е':'e','ё':'e',
	  'ж':'zh','з':'z','и':'i','й':'i','к':'k','л':'l','м':'m','н':'n',
	  'о':'o','п':'p','р':'r','с':'s','т':'t','у':'u','ф':'f','х':'h',
	  'ц':'c','ч':'cz','ш':'sh','щ':'scz','ъ':'','ы':'y','ь':'','э':'e',
	  'ю':'u','я':'ja', 'А':'A','Б':'B','В':'V','Г':'G','Д':'D','Е':'E','Ё':'E',
	  'Ж':'ZH','З':'Z','И':'I','Й':'I','К':'K','Л':'L','М':'M','Н':'N',
	  'О':'O','П':'P','Р':'R','С':'S','Т':'T','У':'U','Ф':'F','Х':'H',
	  'Ц':'C','Ч':'CZ','Ш':'SH','Щ':'SCH','Ъ':'','Ы':'y','Ь':'','Э':'E',
	  'Ю':'U','Я':'YA'}
	print('Привет, набери текст для замены кириллицы на латинские буквы. ')
	print('Для выхода набери "ВЫХОД"')
	while True:
		word = input('Текст для ввода: ')
		if word == 'ВЫХОД':
			break
		new_word = ''
		for letter in word:
			if letter in symbol_dict.keys():
				new_word += symbol_dict[letter]
			else:
				new_word += letter
		print(new_word)

if __name__ == '__main__':
	translate()

